# VectorOrientation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayVectorSettings..::..VectorOrientation Property
AnalysisDisplayVectorSettings Class See Also
---
Vector orientation.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public AnalysisDisplayStyleVectorOrientation VectorOrientation { get; set; }
```

Visual Basic
---
```text
Public Property VectorOrientation As AnalysisDisplayStyleVectorOrientation
	Get
	Set
```

Visual C++
---
```text
public:
property AnalysisDisplayStyleVectorOrientation VectorOrientation {
	AnalysisDisplayStyleVectorOrientation get ();
	void set (AnalysisDisplayStyleVectorOrientation value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
AnalysisDisplayVectorSettings Class
Autodesk.Revit.DB.Analysis Namespace